#### Terragrunt Plan: `environments/org/repositories/3es-website-static`
```
[90m00:54:33.996 [0m[37mSTDOUT [0m[36mterraform: [0mAcquiring state lock. This may take a few moments...
[90m00:54:36.434 [0m[37mSTDOUT [0m[36mterraform: [0mgithub_repository.this[0]: Refreshing state... [id=3es-website-static]
[90m00:54:36.668 [0m[37mSTDOUT [0m[36mterraform: [0mNote: Objects have changed outside of Terraform
[90m00:54:36.668 [0m[37mSTDOUT [0m[36mterraform: [0mTerraform detected the following changes made outside of Terraform since the
[90m00:54:36.668 [0m[37mSTDOUT [0m[36mterraform: [0mlast "terraform apply" which may have affected this plan:
[90m00:54:36.668 [0m[37mSTDOUT [0m[36mterraform: [0m  # github_repository.this[0] has changed
[90m00:54:36.668 [0m[37mSTDOUT [0m[36mterraform: [0m  ~ resource "github_repository" "this" {
[90m00:54:36.668 [0m[37mSTDOUT [0m[36mterraform: [0m      ~ full_name                               = "NZ3ES-Limited/3es-website-static" -> "nz3es/3es-website-static"
[90m00:54:36.668 [0m[37mSTDOUT [0m[36mterraform: [0m      ~ git_clone_url                           = "git://github.com/NZ3ES-Limited/3es-website-static.git" -> "git://github.com/nz3es/3es-website-static.git"
[90m00:54:36.668 [0m[37mSTDOUT [0m[36mterraform: [0m      ~ html_url                                = "https://github.com/NZ3ES-Limited/3es-website-static" -> "https://github.com/nz3es/3es-website-static"
[90m00:54:36.668 [0m[37mSTDOUT [0m[36mterraform: [0m      ~ http_clone_url                          = "https://github.com/NZ3ES-Limited/3es-website-static.git" -> "https://github.com/nz3es/3es-website-static.git"
[90m00:54:36.668 [0m[37mSTDOUT [0m[36mterraform: [0m        id                                      = "3es-website-static"
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0m        name                                    = "3es-website-static"
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0m      ~ ssh_clone_url                           = "git@github.com:NZ3ES-Limited/3es-website-static.git" -> "git@github.com:nz3es/3es-website-static.git"
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0m      ~ svn_url                                 = "https://github.com/NZ3ES-Limited/3es-website-static" -> "https://github.com/nz3es/3es-website-static"
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0m        # (35 unchanged attributes hidden)
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0mUnless you have made equivalent changes to your configuration, or ignored the
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0mrelevant attributes using ignore_changes, the following plan may include
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0mactions to undo or respond to these changes.
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0mTerraform used the selected providers to generate the following execution
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0mplan. Resource actions are indicated with the following symbols:
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0m  + create
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0mTerraform will perform the following actions:
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0m  # github_repository_file.tag_cleanup[0] will be created
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0m  + resource "github_repository_file" "tag_cleanup" {
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0m      + autocreate_branch_source_sha = (known after apply)
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0m      + branch                       = "main"
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0m      + commit_message               = "chore: manage tag cleanup workflow (keep last 3)"
[90m00:54:36.669 [0m[37mSTDOUT [0m[36mterraform: [0m      + commit_sha                   = (known after apply)
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m      + content                      = <<-EOT
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m            name: Cleanup Old Tags
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m            
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m            on:
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m              push:
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                tags:
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                  - "**"
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m              workflow_dispatch:
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m            
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m            jobs:
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m              cleanup:
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                runs-on: ubuntu-latest
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                permissions:
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                  contents: write
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                steps:
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                  - name: Delete old tags, keep last 3
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                    env:
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                      GH_TOKEN: ${{ secrets.GITHUB_TOKEN }}
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                      REPO: ${{ github.repository }}
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                      MAX_TAGS: "3"
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                    run: |
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                      tags=$(gh api repos/$REPO/tags --paginate --jq '.[].name')
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                      total=$(echo "$tags" | wc -l | tr -d ' ')
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                      to_delete=$((total - MAX_TAGS))
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                      if [ "$to_delete" -le 0 ]; then
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                        echo "Only $total tag(s) exist, nothing to delete."
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                        exit 0
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                      fi
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                      echo "$tags" | tail -n "$to_delete" | while read tag; do
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                        echo "Deleting tag: $tag"
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                        gh api -X DELETE repos/$REPO/git/refs/tags/$tag
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m                      done
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m        EOT
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m      + file                         = ".github/workflows/cleanup-tags.yml"
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m      + id                           = (known after apply)
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m      + overwrite_on_create          = true
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m      + ref                          = (known after apply)
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m      + repository                   = "3es-website-static"
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m      + repository_id                = (known after apply)
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m      + sha                          = (known after apply)
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m00:54:36.670 [0m[37mSTDOUT [0m[36mterraform: [0mPlan: 1 to add, 0 to change, 0 to destroy.
[90m00:54:36.671 [0m[37mSTDOUT [0m[36mterraform: [0mChanges to Outputs:
[90m00:54:36.671 [0m[37mSTDOUT [0m[36mterraform: [0m  ~ repository_url  = "https://github.com/NZ3ES-Limited/3es-website-static" -> "https://github.com/nz3es/3es-website-static"
[90m00:54:36.671 [0m[37mSTDOUT [0m[36mterraform: [0mWarning: Redundant ignore_changes element
[90m00:54:36.671 [0m[37mSTDOUT [0m[36mterraform: [0m  on main.tf line 141, in resource "github_repository_file" "tag_cleanup":
[90m00:54:36.671 [0m[37mSTDOUT [0m[36mterraform: [0m 141: resource "github_repository_file" "tag_cleanup" {
[90m00:54:36.671 [0m[37mSTDOUT [0m[36mterraform: [0mAdding an attribute name to ignore_changes tells Terraform to ignore future
[90m00:54:36.671 [0m[37mSTDOUT [0m[36mterraform: [0mchanges to the argument in configuration after the object has been created,
[90m00:54:36.671 [0m[37mSTDOUT [0m[36mterraform: [0mretaining the value originally configured.
[90m00:54:36.671 [0m[37mSTDOUT [0m[36mterraform: [0mThe attribute commit_sha is decided by the provider alone and therefore there
[90m00:54:36.671 [0m[37mSTDOUT [0m[36mterraform: [0mcan be no configured value to compare with. Including this attribute in
[90m00:54:36.671 [0m[37mSTDOUT [0m[36mterraform: [0mignore_changes has no effect. Remove the attribute from ignore_changes to
[90m00:54:36.671 [0m[37mSTDOUT [0m[36mterraform: [0mquiet this warning.
[90m00:54:36.671 [0m[37mSTDOUT [0m[36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[90m00:54:36.671 [0m[37mSTDOUT [0m[36mterraform: [0mNote: You didn't use the -out option to save this plan, so Terraform can't
[90m00:54:36.671 [0m[37mSTDOUT [0m[36mterraform: [0mguarantee to take exactly these actions if you run "terraform apply" now.

```

*Pushed by: @elayaraja-kv*